{"modelTopology": {"training_config": {"loss": "categorical_crossentropy", "metrics": ["accuracy"], "sample_weight_mode": null, "optimizer_config": {"class_name": "Adadelta", "config": {"epsilon": 1e-07, "lr": 1.0, "decay": 0.0, "rho": 0.95}}, "loss_weights": null}, "model_config": {"class_name": "Sequential", "config": [{"class_name": "Conv2D", "config": {"activity_regularizer": null, "strides": [1, 1], "use_bias": true, "dilation_rate": [1, 1], "name": "conv2d_1", "activation": "relu", "bias_constraint": null, "bias_regularizer": null, "padding": "valid", "dtype": "float32", "filters": 80, "kernel_constraint": null, "trainable": true, "kernel_regularizer": null, "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "data_format": "channels_last", "batch_input_shape": [null, 80, 80, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Conv2D", "config": {"activity_regularizer": null, "strides": [1, 1], "use_bias": true, "dilation_rate": [1, 1], "name": "conv2d_2", "activation": "relu", "bias_constraint": null, "bias_regularizer": null, "padding": "valid", "dtype": "float32", "filters": 64, "kernel_constraint": null, "trainable": true, "kernel_regularizer": null, "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "data_format": "channels_last", "batch_input_shape": [null, 80, 80, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "data_format": "channels_last", "name": "max_pooling2d_1", "pool_size": [2, 2], "trainable": true, "strides": [2, 2]}}, {"class_name": "Conv2D", "config": {"activity_regularizer": null, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "dilation_rate": [1, 1], "name": "conv2d_3", "activation": "relu", "bias_constraint": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "data_format": "channels_last", "filters": 64, "kernel_constraint": null, "trainable": true, "kernel_regularizer": null, "kernel_size": [3, 3], "use_bias": true}}, {"class_name": "Dropout", "config": {"trainable": true, "rate": 0.25, "seed": null, "name": "dropout_1", "noise_shape": null}}, {"class_name": "Flatten", "config": {"trainable": true, "data_format": "channels_last", "name": "flatten_1"}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "units": 128, "name": "dense_1", "activation": "relu", "bias_constraint": null, "bias_regularizer": null, "kernel_constraint": null, "trainable": true, "kernel_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Dropout", "config": {"trainable": true, "rate": 0.5, "seed": null, "name": "dropout_2", "noise_shape": null}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "units": 4, "name": "dense_2", "activation": "softmax", "bias_constraint": null, "bias_regularizer": null, "kernel_constraint": null, "trainable": true, "kernel_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}}}]}, "keras_version": "2.1.6", "backend": "tensorflow"}, "weightsManifest": [{"weights": [{"dtype": "float32", "shape": [3, 3, 3, 80], "name": "conv2d_1/kernel"}, {"dtype": "float32", "shape": [80], "name": "conv2d_1/bias"}], "paths": ["group1-shard1of1"]}, {"weights": [{"dtype": "float32", "shape": [3, 3, 80, 64], "name": "conv2d_2/kernel"}, {"dtype": "float32", "shape": [64], "name": "conv2d_2/bias"}], "paths": ["group2-shard1of1"]}, {"weights": [{"dtype": "float32", "shape": [3, 3, 64, 64], "name": "conv2d_3/kernel"}, {"dtype": "float32", "shape": [64], "name": "conv2d_3/bias"}], "paths": ["group3-shard1of1"]}, {"weights": [{"dtype": "float32", "shape": [82944, 128], "name": "dense_1/kernel"}, {"dtype": "float32", "shape": [128], "name": "dense_1/bias"}], "paths": ["group4-shard1of11", "group4-shard2of11", "group4-shard3of11", "group4-shard4of11", "group4-shard5of11", "group4-shard6of11", "group4-shard7of11", "group4-shard8of11", "group4-shard9of11", "group4-shard10of11", "group4-shard11of11"]}, {"weights": [{"dtype": "float32", "shape": [128, 4], "name": "dense_2/kernel"}, {"dtype": "float32", "shape": [4], "name": "dense_2/bias"}], "paths": ["group5-shard1of1"]}]}